[
    {
        "bookId": 1,
        "bookName": "Astrophysics for People in a Hurry",
        "image": "https://i.ibb.co.com/6WccgCs/50fa1f1c-b608-46a6-8146-eb23d9baa76f.png",
        "author": "Neil deGrasse Tyson",
        "review": "Astrophysics for People in a Hurry is an engaging overview of complex topics in astrophysics made accessible for a general audience. Neil deGrasse Tyson explains the fundamentals of the universe, from the Big Bang to black holes, in a way that is both informative and entertaining. His humor and clarity bring cosmic phenomena down to Earth, making this a delightful read for anyone curious about space.",
        "totalPages": 224,
        "rating": 4.5,
        "category": "Science",
        "tags": "Cosmology",
        "publisher": "W. W. Norton & Company",
        "yearOfPublishing": 2017
    },
    {
        "bookId": 2,
        "bookName": "The Wright Brothers",
        "image": "https://i.ibb.co.com/D9MHYJG/book4.png",
        "author": "David McCullough",
        "review": "David McCullough captures the inspirational story of the Wright brothers, showcasing their determination and pioneering spirit. From their bicycle shop in Ohio to their first successful flight, McCullough illustrates the challenges and triumphs faced by Orville and Wilbur Wright. This biography is a testament to the power of perseverance and innovation in the face of adversity.",
        "totalPages": 336,
        "rating": 4.3,
        "category": "Biography",
        "tags": "Aviation",
        "publisher": "Simon & Schuster",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 3,
        "bookName": "Thinking, Fast and Slow",
        "image": "https://i.ibb.co.com/ZGc9F3h/c6e9f907-c4ae-4b9d-bd0b-dcaee938285e.png",
        "author": "Daniel Kahneman",
        "review": "Thinking, Fast and Slow explores the dual systems that drive human thinking. Kahneman's insights into our cognitive biases and decision-making processes are thought-provoking and insightful. This book reveals the complexities of human thought and challenges readers to understand the limitations of their own judgment.",
        "totalPages": 499,
        "rating": 4.2,
        "category": "Psychology",
        "tags": "Cognitive Science",
        "publisher": "Farrar, Straus and Giroux",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 4,
        "bookName": "The 7 Habits of Highly Effective People",
        "image": "https://i.ibb.co.com/cD6Ftx1/book2.png",
        "author": "Stephen Covey",
        "review": "Covey's classic on personal development, The 7 Habits of Highly Effective People, lays out timeless principles for achieving success and balance in life. His focus on personal responsibility and proactive behavior encourages readers to adopt habits that lead to long-term growth and effectiveness.",
        "totalPages": 381,
        "rating": 4.1,
        "category": "Self-Help",
        "tags": "Productivity",
        "publisher": "Free Press",
        "yearOfPublishing": 1989
    },
    {
        "bookId": 5,
        "bookName": "The Warmth of Other Suns",
        "image": "https://i.ibb.co.com/C60pzVW/6428d7e8-1ee0-44d4-87db-4a096405f60b.png",
        "author": "Isabel Wilkerson",
        "review": "Isabel Wilkerson chronicles the Great Migration, during which African Americans moved from the Southern U.S. to northern and western cities. Through the experiences of three individuals, Wilkerson paints a vivid portrait of resilience and hope. This historical account reveals the impact of migration on American society and culture.",
        "totalPages": 622,
        "rating": 4.4,
        "category": "History",
        "tags": "Migration",
        "publisher": "Random House",
        "yearOfPublishing": 2010
    },
    {
        "bookId": 6,
        "bookName": "The New Jim Crow: Mass Incarceration in the Age of Colorblindness",
        "image": "https://i.ibb.co.com/ZSy31CB/1330e1d9-3d40-46c5-88a4-7216914d79e3.png",
        "author": "Michelle Alexander",
        "review": "Michelle Alexander provides a powerful critique of the U.S. criminal justice system, arguing that it perpetuates racial discrimination and inequality. Her analysis of mass incarceration as a form of racial control challenges readers to reconsider the role of the justice system and the concept of colorblindness in contemporary society.",
        "totalPages": 312,
        "rating": 4.5,
        "category": "Sociology",
        "tags": "Justice",
        "publisher": "The New Press",
        "yearOfPublishing": 2010
    },
    {
        "bookId": 7,
        "bookName": "Midnight in the Garden of Good and Evil",
        "image": "https://i.ibb.co.com/mSkFrpp/556a460a-ac51-4e13-8aa0-fe29aedd96f5.png",
        "author": "John Berendt",
        "review": "This true-crime narrative set in Savannah, Georgia, follows the eccentric characters and Southern gothic landscape of the city. Berendt's exploration of crime and mystery is compelling and paints a haunting portrait of Southern charm. Midnight in the Garden of Good and Evil remains a classic in literary nonfiction.",
        "totalPages": 400,
        "rating": 4.1,
        "category": "True Crime",
        "tags": "Mystery",
        "publisher": "Random House",
        "yearOfPublishing": 1994
    },
    {
        "bookId": 8,
        "bookName": "In Cold Blood",
        "image": "https://i.ibb.co.com/HN40SJW/674687c7-f482-4ea0-9e8d-5fb3e00640a2.png",
        "author": "Truman Capote",
        "review": "In Cold Blood is Truman Capote's masterful exploration of a real-life murder case in rural Kansas. The book delves into the psychology of the killers and the impact on the victims’ families. Capote's writing is both chilling and compassionate, making this work a seminal piece in true crime literature.",
        "totalPages": 343,
        "rating": 4.3,
        "category": "True Crime",
        "tags": "Murder",
        "publisher": "Random House",
        "yearOfPublishing": 1966
    },
    {
        "bookId": 9,
        "bookName": "Why We Sleep",
        "image": "https://i.ibb.co.com/sCmbwtX/d635814d-cbdc-4173-a87a-2654128e5167.png",
        "author": "Matthew Walker",
        "review": "Matthew Walker delves into the science of sleep, explaining why sleep is essential for our mental and physical well-being. The book discusses the effects of sleep on health, memory, and emotions, making it an enlightening read for anyone interested in understanding and improving their sleep habits.",
        "totalPages": 360,
        "rating": 4.6,
        "category": "Health",
        "tags": "Sleep Science",
        "publisher": "Scribner",
        "yearOfPublishing": 2017
    },
    {
        "bookId": 10,
        "bookName": "Breath: The New Science of a Lost Art",
        "image": "https://i.ibb.co.com/gwc3Zb6/e6f18337-31fc-4cd5-9a33-5467a82fb605.png",
        "author": "James Nestor",
        "review": "James Nestor uncovers the forgotten science of breathing, exploring techniques that have been practiced for centuries. This book is a fascinating investigation into how breathing can affect our health, mindset, and overall well-being, making it a must-read for those interested in wellness.",
        "totalPages": 304,
        "rating": 4.4,
        "category": "Health",
        "tags": "Breathing",
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2020
    },
    {
        "bookId": 11,
        "bookName": "How Not to Die",
        "image": "https://i.ibb.co/VpZpvsk/d1b6ebd9-a4f1-415b-8841-3ae807106e18.png",
        "author": "Gene Stone and Michael Greger",
        "review": "How Not to Die explores how certain lifestyle and dietary changes can prevent common diseases. The book is backed by substantial scientific research and offers practical advice on plant-based diets, exercise, and other habits to live a long, healthy life. It’s packed with insights on food as medicine and empowers readers to take control of their well-being by making informed choices.",
        "totalPages": 576,
        "rating": 4.7,
        "category": "Health",
        "tags": "Nutrition",
        "publisher": "Flatiron Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 12,
        "bookName": "1776",
        "image": "https://i.ibb.co/8XDS7tb/43e80651-95d4-479e-ba99-698e3f3739b0.png",
        "author": "David McCullough",
        "review": "David McCullough’s '1776' delves into the challenges and triumphs of the American Revolution. With extensive research and storytelling, McCullough illustrates the resilience and struggles of the American spirit through pivotal battles and decisions that shaped the country. It offers a balanced perspective on the year’s defining moments, focusing on leadership, strategy, and patriotism.",
        "totalPages": 386,
        "rating": 4.5,
        "category": "History",
        "tags": "American Revolution",
        "publisher": "Simon & Schuster",
        "yearOfPublishing": 2005
    },
    {
        "bookId": 13,
        "bookName": "The Four Agreements: A Practical Guide to Personal Freedom",
        "image": "https://i.ibb.co/ftbw75G/d761768b-1486-4508-8942-ed4cccb57370.png",
        "author": "Don Miguel Ruiz",
        "review": "This transformative book shares four core agreements to achieve personal freedom and true happiness: be impeccable with your word, don’t take anything personally, don’t make assumptions, and always do your best. Ruiz blends ancient Toltec wisdom with modern-day life principles, offering profound insights into personal growth, self-reflection, and the pursuit of inner peace.",
        "totalPages": 160,
        "rating": 4.2,
        "category": "Self-help",
        "tags": "Personal Development",
        "publisher": "Amber-Allen Publishing",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 14,
        "bookName": "Meditations",
        "image": "https://i.ibb.co/wM7SBrt/6b4be883-b0c6-4d45-b10e-9aa7afc2dcae.png",
        "author": "Marcus Aurelius",
        "review": "Written by the Roman Emperor Marcus Aurelius, 'Meditations' is a profound and timeless collection of personal reflections on Stoic philosophy. Aurelius discusses how to live a virtuous life, deal with adversity, and maintain inner tranquility. His words offer guidance on self-discipline, wisdom, and resilience, making it relevant for modern readers seeking inner peace and strength.",
        "totalPages": 304,
        "rating": 4.4,
        "category": "Philosophy",
        "tags": "Stoicism",
        "publisher": "Penguin Classics",
        "yearOfPublishing": 180
    },
    {
        "bookId": 15,
        "bookName": "The Art of Happiness",
        "image": "https://i.ibb.co/gytB2kf/13c42719-465f-4b27-8925-1d6158036048.png",
        "author": "14th Dalai Lama and Howard C. Cutler",
        "review": "In this insightful book, the Dalai Lama shares his thoughts on happiness as a human goal, achieved through compassion and inner peace. With discussions on anger, anxiety, and fear, he offers guidance for overcoming negative emotions. The Art of Happiness encourages readers to foster happiness through kindness, wisdom, and a balanced approach to life’s challenges.",
        "totalPages": 352,
        "rating": 4.3,
        "category": "Spirituality",
        "tags": "Happiness",
        "publisher": "Riverhead Books",
        "yearOfPublishing": 1998
    },
    {
        "bookId": 16,
        "bookName": "Good to Great",
        "image": "https://i.ibb.co/9NxW7Hp/ad3cbdbb-2658-41bc-854c-9cc90c0cd151.png",
        "author": "James C. Collins",
        "review": "James Collins examines why some companies achieve long-term success while others fail. By analyzing successful companies, Collins identifies key strategies that help organizations transition from good to great, focusing on leadership, discipline, and the importance of sustained effort. This book is essential for anyone looking to understand business success principles.",
        "totalPages": 320,
        "rating": 4.6,
        "category": "Business",
        "tags": "Leadership",
        "publisher": "HarperBusiness",
        "yearOfPublishing": 2001
    },
    {
        "bookId": 17,
        "bookName": "Man's Search for Meaning",
        "image": "https://i.ibb.co/fd1Bvch/f00e4aae-33fd-4e64-ba14-59362a866bd4.png",
        "author": "Viktor Frankl",
        "review": "Viktor Frankl, a Holocaust survivor, shares his profound insights on finding meaning in life despite suffering. He introduces logotherapy, emphasizing that life’s meaning can be discovered in every experience, even adversity. This book is both a memoir and a guide to understanding the human spirit’s resilience.",
        "totalPages": 200,
        "rating": 4.5,
        "category": "Psychology",
        "tags": "Purpose",
        "publisher": "Beacon Press",
        "yearOfPublishing": 1946
    },
    {
        "bookId": 18,
        "bookName": "Educated",
        "image": "https://i.ibb.co/BBXNgq8/7c5b75b9-1463-4128-9a5d-d479242200a3.png",
        "author": "Tara Westover",
        "review": "Educated is a memoir of Tara Westover’s journey from growing up in an isolated family without formal education to earning a PhD. Her story explores themes of self-discovery, resilience, and the importance of education. It’s a powerful testament to the transformative power of knowledge and determination.",
        "totalPages": 334,
        "rating": 4.7,
        "category": "Biography",
        "tags": "Education",
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 19,
        "bookName": "Atomic Habits",
        "image": "https://i.ibb.co/qkbqtrN/533c05c0-a5e7-4f7d-9289-cece0d98b31f.png",
        "author": "James Clear",
        "review": "Atomic Habits provides practical strategies for building good habits and breaking bad ones. James Clear explains how small changes in behavior can compound over time to create remarkable results. The book emphasizes actionable techniques, making it a must-read for anyone looking to improve their life through habit transformation.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Self-help",
        "tags": "Habits",
        "publisher": "Avery",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 20,
        "bookName": "The Big Short",
        "image": "https://i.ibb.co/p3KmhyV/23aa9acf-aef4-449a-a65e-f2b0da68fd5f.png",
        "author": "Michael Lewis",
        "review": "The Big Short delves into the 2008 financial crisis, exposing the greed and flaws within the financial industry. Michael Lewis provides a fascinating look at the individuals who foresaw the crisis and acted on it, challenging the industry norms. It’s an eye-opening exploration of market dynamics and systemic issues.",
        "totalPages": 291,
        "rating": 4.3,
        "category": "Finance",
        "tags": "Economics",
        "publisher": "W. W. Norton & Company",
        "yearOfPublishing": 2010
    },
    {
        "bookId": 21,
        "bookName": "The Lean Startup",
        "image": "https://i.ibb.co/F6knCN0/a0a1efbc-a51c-42a0-82d8-767bc4b586a2.png",
        "author": "Eric Ries",
        "review": "The Lean Startup provides a framework for entrepreneurs to create successful startups by focusing on constant innovation and customer feedback. Eric Ries introduces concepts like 'minimum viable product' and 'validated learning,' making it a foundational text for those interested in agile business practices.",
        "totalPages": 336,
        "rating": 4.1,
        "category": "Business",
        "tags": "Entrepreneurship",
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 22,
        "bookName": "Gitanjali",
        "image": "https://images.deepai.org/art-image/987373d9cec5403a890fed7677803789/create-a-realistic-3d-render-of-a-hardcover-b_B8cT1nZ.jpg",
        "author": "Rabindranath Tagore",
        "review": "Gitanjali, a collection of Tagore’s poems, reflects spiritual and philosophical themes, exploring divinity, love, and the human soul. Each poem is an expression of Tagore’s connection with the divine and his search for inner peace. Recognized globally, Gitanjali is a masterpiece of Bengali and world literature.",
        "totalPages": 104,
        "rating": 4.6,
        "category": "Poetry",
        "tags": "Spirituality",
        "publisher": "Macmillan Publishers",
        "yearOfPublishing": 1912
    }
]

